Grasshopper.Kernel.GH_Format.FormatString(System.String,System.Object[])
Replaces the format items in a string with the string representations of corresponding objects in a specified array.
text: A composite format string.
args: An object array that contains zero or more objects to format.
Returns: A copy of format in which the format items have been replaced by the string representation of the corresponding objects in args.
Remarks:
Formatting is done using invariant-culture formatting information.