Grasshopper.Rhinoceros.ModelManifest.Synchronized
ModelManifest keeps Synchronized content up to date with the twin object in the Rhino document.

Grasshopper.Rhinoceros.ModelManifest.SynchronizedScope(System.Boolean)
Activate-deactivate synchronized content creation.
synchronized:
Returns: