Grasshopper.Plugin.GH_RhinoScriptInterface.LoadedPluginNames
Gets an array of the names and versions (if known) of all loaded plugins.

Grasshopper.Plugin.GH_RhinoScriptInterface.LoadedPluginGuids
Gets an array of the IDs of all loaded plugins.