Grasshopper.Instances.RedrawAll
Forces a redraw of both the active canvas and the Rhino viewports on the active document.

Grasshopper.Instances.RedrawAllDocumentsViewports(System.Boolean)
Redraws all open Rhino documents viewports.