Grasshopper.Kernel.GH_DocumentEventServer.Enabled
Gets or sets the enabled state flag for this event watcher.

Grasshopper.Kernel.GH_DocumentEventServer.ExpireObjects(System.Guid,System.Boolean,System.Boolean)
Expire all the objects that are associated with the given Rhino Object Id.