Grasshopper.Kernel.GH_DocumentServer.AddDocument(Grasshopper.Kernel.GH_Document)
Add a new document to the global list. If the document is already registered nothing will happen.
This also applies to a different document which points to the same file path
document: Document to add.
Throws System.ArgumentNullException: Thrown when the document is a null reference.
Throws System.InvalidOperationException: Thrown when the document doesn't have top-level rank.

Grasshopper.Kernel.GH_DocumentServer.AddDocument(Grasshopper.Kernel.GH_Document,System.Boolean@)
Add a new document to the global list. If the document is already registered nothing will happen.
This also applies to a different document which points to the same file path
document: Document to add.
Throws System.ArgumentNullException: Thrown when the document is a null reference.
Throws System.InvalidOperationException: Thrown when the document doesn't have top-level rank.