Grasshopper.Kernel.Types.GH_Plane.IsGeometryLoaded
Gets the load state of this plane. The plane is considered to be loaded when it is valid.

Grasshopper.Kernel.Types.GH_Plane.LoadGeometry
If the geometry is referenced and not yet loaded, attempts to load the geometry.
Returns: True if the geometry is loaded (or if it was already loaded), False on failure.