Grasshopper.Plugin.Commands.Run_GrasshopperBake(Rhino.RhinoDoc,Rhino.Commands.RunMode)
Run the _GrasshopperBake command logic.
This command requires either the BakeDocument or the BakeObject fields to be set.
This command is typically run from within the Grasshopper GUI, it should be hidden from the user.
doc:
mode:
Returns: True on success, false on failure. (Redraw required on success)