Grasshopper.Kernel.GH_ComponentParamServer.InventUniqueNickname(System.String,System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_Param})
Create a new, unique parameter nickname.
allowedChars: Allowed character set for naming logic.
existingNames: A collection of parameter names to avoid.
Returns: The first name combination that doesn't occur in the existingNames collection.

Grasshopper.Kernel.GH_ComponentParamServer.InventUniqueNickname(System.String,System.Collections.Generic.IEnumerable{System.String})
Create a new, unique parameter nickname.
allowedChars: Allowed character set for naming logic.
existingNames: A collection of parameter names to avoid.
Returns: The first name combination that doesn't occur in the existingNames collection.