Grasshopper.Kernel.GH_Convert.CommonObjectToByteArray(Rhino.Runtime.CommonObject)
Convert a RhinoCommon object into a compressed byte-array using OpenNurbs serialization.
data: Object to serialize.
Returns: A byte array representing the object or null on failure.

Grasshopper.Kernel.GH_Convert.CommonObjectToNRBF(System.Int32,Rhino.Runtime.CommonObject)
Convert a RhinoCommon object into a NRBF byte-array.
data: Object to serialize.
Returns: A byte array representing the object or null on failure.

Grasshopper.Kernel.GH_Convert.NRBFToCommonObject``1(System.Byte[])
Convert an OpenNurbs compliant NRBF byte array into a RhinoCommon object.
data: Byte array to de-serialize.
Returns: A RhinoCommon object instance or null on failure.