Grasshopper.Rhinoceros.ModelContent.AsFrozen(System.Boolean)
Try to obtain a dereferenced snapshot of itself.
deep: Whether or not referenced content should also be frozen.
Returns: Itself if it is already dereferenced.